src/cf/Documents/РегистрУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>РегистрУчета</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидРегистра</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыРегистровУчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВключатьОбособленныеПодразделения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматСохраненияФайла</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ФорматыСохраненияОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/CommonModules/РегистрыУчетаКлиент/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Отчетность по регистрам учета 
// 
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Сохраняет табличный документ как регистр учета
// Вызывается из формы отчета
//
Процедура СохранитьРегистрУчета(Форма, Знач Подписать = Ложь) Экспорт
	
	ДанныеСохранения = Неопределено;
	
	ТаблицаРегистра = Форма.Результат;
	
	Если ПроверитьВозможностьСохраненияРезультата(Форма, ТаблицаРегистра, Подписать) Тогда
		
		Отчет = Форма.Отчет;
		
		СвойстваРегистраУчета = Новый Структура("Организация, ПодразделениеОрганизации, ВключатьОбособленныеПодразделения,
		|НачалоПериода, КонецПериода, ВидРегистра, ТаблицаРегистра");
		СвойстваРегистраУчета.Организация = Отчет.Организация;
		Отчет.Свойство("Подразделение",СвойстваРегистраУчета.ПодразделениеОрганизации);
		Отчет.Свойство("ВключатьОбособленныеПодразделения",СвойстваРегистраУчета.ВключатьОбособленныеПодразделения);
		СвойстваРегистраУчета.НачалоПериода = Отчет.НачалоПериода;
		СвойстваРегистраУчета.КонецПериода  = Отчет.КонецПериода;
		СвойстваРегистраУчета.ВидРегистра   = Форма.ВидРегистра;
		СвойстваРегистраУчета.ТаблицаРегистра = ПоместитьВоВременноеХранилище(ТаблицаРегистра, Новый УникальныйИдентификатор);
		
		ДанныеСохранения = РегистрыУчетаВызовСервера.СохранитьРегистрУчета(СвойстваРегистраУчета);
		
		Если ДанныеСохранения <> Неопределено Тогда
			
			Если Подписать Тогда
				
				ПрисоединенныеФайлыКлиент.ПодписатьФайл(ДанныеСохранения.ПрисоединенныйФайл, Форма.УникальныйИдентификатор);	
				
			Конецесли;	
			
			Оповестить("Запись_ПрисоединенныйФайл", Новый Структура, ДанныеСохранения.ПрисоединенныйФайл);
			
			ПоказатьОповещениеПользователя(
			НСтр("ru = 'Сохранение'"),
			ПолучитьНавигационнуюСсылку(ДанныеСохранения.РегистрУчета),
			ДанныеСохранения.ОписаниеРегистра,
			БиблиотекаКартинок.Информация32);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Открывает список сохраненных регистров учета с отбором
// Вызывается из формы отчета
//
Процедура ОткрытьАрхивРегистровУчета(Форма) Экспорт
	
	Отчет = Форма.Отчет;
	ВидРегистра = Форма.ВидРегистра;
	
	Если ЗначениеЗаполнено(ВидРегистра) Тогда
		ПараметрыОткрытияФормы = Новый Структура();
		ПараметрыОткрытияФормы.Вставить("Отбор", Новый Структура("ВидРегистра, Организация, НачалоПериода, КонецПериода"
		, ВидРегистра, Отчет.Организация, Отчет.НачалоПериода,Отчет.КонецПериода));
		
		ОткрытьФорму("Документ.РегистрУчета.ФормаСписка", ПараметрыОткрытияФормы);
	КонецЕсли;
	
КонецПроцедуры	

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

//Проверяет состояние табличного документа
//
Функция ПроверитьВозможностьСохраненияРезультата(Форма, ТаблицаРегистра, ПроверитьВозможностьПодписи = Ложь)
	
	
	// Проверка формы отчета
	// Должна быть указана Организация
	//
	// Должны стоять флаги:
	// - Выводить заголовок (Заголовок)
	// - Выводить подписи   (Подписи)
	// - Выводить единицу измерения (Единица измерения)
	
	Если Не ЗначениеЗаполнено(Форма.Отчет.Организация) Тогда
		
		ТекстСообщения = Нстр("ru = 'Для сохранения регистра учета, отчет должен быть сформирован по организации'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "ПолеОрганизация");
		Возврат Ложь;
		
	КонецЕсли;
	
	СостояниеРегистра = Форма.Элементы.Результат.ОтображениеСостояния;
	
	Если СостояниеРегистра.Видимость Тогда
		ТекстСообщения = Нстр("ru = 'Отчет не может быть сохранен'");
		СостояниеРегистраТекст = СостояниеРегистра.Текст;
		Если ЗначениеЗаполнено(СостояниеРегистраТекст) Тогда
			ТекстСообщения = СостояниеРегистраТекст;
		КонецЕсли;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "Результат");
		Возврат Ложь;
	КонецЕсли;
	
	Если Не Форма.ВыводитьЗаголовок Тогда
		
		ТекстСообщения = Нстр("ru = 'Для сохранения регистра учета, флаг ""Заголовок"" должен быть установлен'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "ВыводитьЗаголовок");
		ПоказатьСтраницуНастроек(Форма);
		Возврат Ложь;
		
	КонецЕсли;
	
	Если Не Форма.ВыводитьПодвал Тогда
		
		ТекстСообщения = Нстр("ru = 'Для сохранения регистра учета, флаг ""Подписи"" должен быть установлен'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "ВыводитьПодвал");
		ПоказатьСтраницуНастроек(Форма);
		Возврат Ложь;
		
	КонецЕсли;
	
	Если Не Форма.ВыводитьЕдиницуИзмерения Тогда
		
		ТекстСообщения = Нстр("ru = 'Для сохранения регистра учета, флаг ""Единица измерения"" должен быть установлен'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "ВыводитьЕдиницуИзмерения");
		ПоказатьСтраницуНастроек(Форма);
		Возврат Ложь;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Форма.ВидРегистра) Тогда
		
		ТекстСообщения = Нстр("ru = 'Для отчета не задан вид регистра в справочнике ""Виды регистров учета"", отчет не сохранен'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат Ложь;
		
	КонецЕсли;
	
	Если ТаблицаРегистра.ШиринаТаблицы = 0 Тогда
		ТекстСообщения = Нстр("ru = 'Отчет не может быть сохранен'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "Результат");
		Возврат Ложь;
	КонецЕсли;

	Если ПроверитьВозможностьПодписи И НЕ Форма.ИспользуетсяЭП Тогда
		СообщениеОбОшибке = НСтр("ru='Для подписи регистра включите использование электронной подписи в настройках программы'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеОбОшибке);
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Показывает страницу настроек отчета
//
Процедура ПоказатьСтраницуНастроек(Форма)
	Если Форма.Элементы.Найти("РазделыОтчета") <> Неопределено Тогда
		Форма.Элементы.РазделыОтчета.ТекущаяСтраница		 = Форма.Элементы.НастройкиОтчета;
		Форма.Элементы.ПрименитьНастройки.КнопкаПоУмолчанию	 = Истина;
	КонецЕсли;
КонецПроцедуры
